# Using Pandas to Transform Data

## Objectives: 

-

## Agenda

-

Some great resources:

- https://www.dataschool.io/
- https://realpython.com/fast-flexible-pandas/
- https://chrisalbon.com/#python
- https://pandas.pydata.org/pandas-docs/version/0.15/tutorials.html
- https://medium.com/dunder-data/pandas-tutorials/home

## Pandas

In [2]:
import pandas as pd
import numpy as np

### Create a dataframe from a csv file

In [4]:
movies = pd.read_csv('IMDB-Movie-Data.csv', index_col=0)
movies.head()

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [5]:
movies.shape

(1000, 11)

In [6]:
pd.set_option('display.max_columns', 20)
pd.set_option('display.max_rows', 100)

In [8]:
#movies

## What is subset selection?
Before we start doing subset selection, it might be good to define what it is. Subset selection is simply selecting particular rows and columns of data from a DataFrame (or Series). This could mean selecting all the rows and some of the columns, some of the rows and all of the columns, or some of each of the rows and columns. 

**Indexers**

There are many ways to select subsets of data, but in this article we will only cover the usage of the square brackets ([]), .loc and .iloc. Collectively, they are called the indexers. These are by far the most common ways to select data.

**What’s the difference between indexing and selecting subsets of data?**

The documentation uses the term indexing frequently. This term is essentially just a one-word phrase to say ‘subset selection’. I prefer the term subset selection as, again, it is more descriptive of what is actually happening. Indexing is also the term used in the official Python documentation.


**A term for just those square brackets**
The term **indexing operator** is used to refer to the square brackets following an object. The .loc and .iloc indexers also use the indexing operator to make selections. I will use the term just the indexing operator to refer to df[]. This will distinguish it from df.loc[] and df.iloc[].

### Indexing Operator

selecting one column as a series

In [ ]:
movies['Title']

selecting one column as a dataframe

In [ ]:
movies[['Title']]

selecting multiple columns

In [ ]:
movies[['Title', 'Year', 'Rating']]

In [ ]:
#using the indexing operator to select rows
movies[3:6]

### Summary: Indexing Operator
- Its primary purpose is to select columns by the column names
- Select a single column as a Series by passing the column name directly to it: df['col_name']
- Select multiple columns as a DataFrame by passing a list to it: df[['col_name1', 'col_name2']]
- You actually can select rows with it, but this is confusing and not used often.

### .loc
The .loc indexer selects data in a different way than just the indexing operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns. Most importantly, it only selects data by the LABEL of the rows and columns.

In [ ]:
movies_title = movies.set_index('Title')

In [ ]:
movies_title.head()

In [ ]:
movies_title.loc['Sing']

In [ ]:
movies_title.loc[['Prometheus','Sing']]

In [ ]:
movies_title.loc['Prometheus':'Sing']

**Selecting rows and columns simultaneously with .loc**

Unlike just the indexing operator, it is possible to select rows and columns simultaneously with .loc. You do it by separating your row and column selections by a comma. It will look something like this:

`df.loc[row_selection, column_selection]`

In [ ]:
movies.loc[1:3, ['Title','Genre', 'Year']]

In [ ]:
movies_title.loc['Prometheus':'Sing', ['Genre', 'Year']]

In [ ]:
movies_title.loc[['Prometheus','Sing'], ['Genre', 'Year']]

In [ ]:
movies_title.loc[]

### Summary of .loc
- Only uses labels
- Can select rows and columns simultaneously
- Selection can be a single label, a list of labels or a slice of labels
- Put a comma between row and column selections

### Getting started with .iloc
The .iloc indexer is very similar to .loc but only uses integer locations to make its selections. The word .iloc itself stands for integer location so that should help with remember what it does.

In [ ]:
movies.iloc[3]

In [ ]:
movies.iloc[3:6]

In [ ]:
movies_title.iloc[:5]

In [ ]:
movies_title.iloc[3:4, :3]

## Conditional selections


For example, what if we want to filter our movies DataFrame to show only films directed by Ridley Scott or films with a rating greater than or equal to 8.0?

In [9]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [10]:
data[[True, False, True, False,True, False,True,]]

    k1  k2
0  one   1
2  one   2
4  two   3
6  two   4

In [11]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [12]:
# method that returns a boolean Series indicating whether each row 
# is a duplicate or not
data[data.duplicated()]

    k1  k2
1  one   1
4  two   3
6  two   4

In [14]:
condition = (movies['Director'] == "Ridley Scott")

#condition

We want to filter out all movies not directed by Ridley Scott, in other words, we don’t want the False films. To return the rows where that condition is True we have to pass this operation into the DataFrame:

In [ ]:
movies[condition]

In [ ]:
movies[movies['Director'] == "Ridley Scott"]

**Find how many movies were directed by Christopher Nolan.**

In [21]:
#put your code here
movies[movies['Director'] == 'Christopher Nolan']
# Nolan_movies = (movies['Director'] == 'Christopher Nolan').sum()
# Nolan_movies

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
37,Interstellar,"Adventure,Drama,Sci-Fi",A team of explorers travel through a wormhole ...,Christopher Nolan,"Matthew McConaughey, Anne Hathaway, Jessica Ch...",2014,169,8.6,1047747,187.99,74.0
55,The Dark Knight,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.32,82.0
65,The Prestige,"Drama,Mystery,Sci-Fi",Two stage magicians engage in competitive one-...,Christopher Nolan,"Christian Bale, Hugh Jackman, Scarlett Johanss...",2006,130,8.5,913152,53.08,66.0
81,Inception,"Action,Adventure,Sci-Fi","A thief, who steals corporate secrets through ...",Christopher Nolan,"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen...",2010,148,8.8,1583625,292.57,74.0
125,The Dark Knight Rises,"Action,Thriller",Eight years after the Joker's reign of anarchy...,Christopher Nolan,"Christian Bale, Tom Hardy, Anne Hathaway,Gary ...",2012,164,8.5,1222645,448.13,78.0

Let's look at conditional selections using numerical values by filtering the DataFrame by ratings:

In [22]:
movies[movies['Rating'] >= 8.8]

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
55,The Dark Knight,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.32,82.0
81,Inception,"Action,Adventure,Sci-Fi","A thief, who steals corporate secrets through ...",Christopher Nolan,"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen...",2010,148,8.8,1583625,292.57,74.0
118,Dangal,"Action,Biography,Drama",Former wrestler Mahavir Singh Phogat and his t...,Nitesh Tiwari,"Aamir Khan, Sakshi Tanwar, Fatima Sana Shaikh,...",2016,161,8.8,48969,11.15,NaN

We can make some richer conditionals by using logical operators: 
- `|`    for "or"  
- `&`    for "and"


Let's filter the the DataFrame to show only movies by Christopher Nolan OR Ridley Scott:

In [ ]:
movies[(movies['Director'] == 'Christopher Nolan') | (movies['Director'] == 'Ridley Scott')]

** What is the average revenue of all of the movies by Christopher Nolan that have a score of 8.7 or better**

In [23]:
movies.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [26]:
# your code here

Nolan_Highrate = movies[(movies['Director'] == 'Christopher Nolan') & (movies['Rating'] >= 8.7)]

Nolan_Highrate['Revenue (Millions)'].mean()

#Nolan_Highrate

412.94500000000005

Using the `isin()` method we could make this more concise though:

In [ ]:
movies[movies['Director'].isin(['Christopher Nolan', 'Ridley Scott'])].head()

Using `~` flips your booleans and allows you to find the inverse of your query.

In [ ]:
movies[~movies['Director'].isin(['Christopher Nolan', 'Ridley Scott'])].head()

## Applied Question: 

Which group of movies has the higher average revenue those with a rating of above 8, or those with at least 300,000 reviews?

In [28]:
# Subset the dataframe to find movies with a rating above 8.
rating8 = movies[movies['Rating'] > 8]
#rating8.head()

# Find the average revenue of that group.
rating8['Revenue (Millions)'].mean()

# Subset the dataframe to find movies with more than 300,000 votes.
rating8v = rating8[rating8['Votes'] > 300000]
#rating8v.head()

# find the average of that group
rating8v['Votes'].mean()

In [ ]:
# Find the average revenue of that group.
rating8['Revenue (Millions)'].mean()

In [30]:
# Subset the dataframe to find movies with more than 300,000 votes.
rating8v = rating8[rating8['Votes'] > 300000]
#rating8v.head()

In [32]:
# find the average of that group
rating8v['Votes'].mean()

715561.6388888889

## Data transformation

### Removing duplicates

Duplicate rows may be found in a DataFrame for any number of reasons. Here is an example:

In [33]:

data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

If I call `data` again why are there still duplicates?

In [34]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [35]:
data.drop_duplicates(inplace=True)
data

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [36]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})

#we are adding another column to help us understand which row was dropped
data['v1'] = range(7)

data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [37]:

data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [38]:

data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
2  one   2   2
6  two   4   6

In [39]:
myData = data.drop_duplicates(['k1'], keep='last')

## Create a new column

In [ ]:
movies['new_col'] = 0

In [ ]:
movies.head()

In [ ]:
movies['power'] = movies['Rating']* np.log(movies['Votes'])

In [ ]:
movies.head()

## Conditional Transformations

You want to create a new column that shows the revenue for a movie if the movie is longer than 90 minutes or shorter than 190 minutes. 

Given what you knwo about python, how would you go about doing this? 

Write pseudo-code with a partner to come up with the workflow.

In [40]:
movies.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [44]:
# feature_length = movies[(movies['Runtime (Minutes)'] > 90) | (movies['Runtime (Minutes)'] < 190)]
# #movies['feature_length'] = feature_length['Revenue (Millions)']
# feature_length.head()




new_list = []

for i in range(movies.shape[0]):

    movie = movies.iloc[i]

    if (movies['Runtime (Minutes)'] > 90) & (movies['Runtime (Minutes)'] <190):
        new_list.append(movie['Revenue (Millions)'])
    else: 
        new_list.append(np.nan)

movies['new_col'] = new_list

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

#### Looping with .itertuples() and .iterrows()
What other approaches can you take? Well, Pandas has actually made the for i in range(len(df)) syntax redundant by introducing the DataFrame.itertuples() and DataFrame.iterrows() methods. These are both generator methods that yield one row at a time.

`.itertuples()` yields a namedtuple for each row, with the row’s index value as the first element of the tuple. A nametuple is a data structure from Python’s collections module that behaves like a Python tuple but has fields accessible by attribute lookup.

`.iterrows()` yields pairs (tuples) of (index, Series) for each row in the DataFrame.

While .itertuples() tends to be a bit faster, let’s stay in Pandas and use .iterrows() in this example, because some readers might not have run across nametuple. Let’s see what this achieves:

In [45]:
@timeit(repeat=3, number=100)
def apply_transormation_iterrows(df):
    revenue_list = []
    for index, row in df.iterrows():
        time = row['Runtime (Minutes)']
        
        #use function
        # Append cost list
        revenue = apply_time(time)
        revenue_list.append(revenue)
    df['rev_features'] = revenue_list

apply_transformation_iterrows(movies)

NameError: name 'timeit' is not defined

### Pandas’ .apply()
You can further improve this operation using the .apply() method instead of .iterrows(). Pandas’ .apply() method takes functions (callables) and applies them along an axis of a DataFrame (all rows, or all columns). In this example, a lambda function will help you pass the column of data into apply_time():

In [ ]:
@timeit(repeat=3, number=100)
def apply_transformation_withapply(df):
    df['rev_features_a'] = df.apply(
        lambda row: apply_time(
            row['Runtime (Minutes)']),
        axis=1)

apply_transformation_withapply(df)